### Importing Libraries

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Creating DataFrame

In [22]:
employees = {
    "id": [1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627, 1628, 1629, 1630],
    "first_name": ["Muhammad", "Mustafa", "Muhammad", "Amr", "Mohanad", "Ahmed", "Dexter", "Marwan", "Mina", "Adel", "Osama"],
    "last_name":["Khalil", "Saad", "Samir", "Gaber", "Hatem", "Saleh", "Morgan", "Radwan", "Mamdouh", "Sobhy", "Muhammad"],
    "salary": [20000, 21000, 18000, 18000, 120000, 19500, 20000, 21000, 17500, 19800, 150000]
}

In [23]:
df = pd.DataFrame(employees)

In [24]:
df.set_index("id", inplace=True)

In [34]:
df.shape

(11, 3)

In [25]:
df

     first_name last_name  salary
id
1620   Muhammad    Khalil   20000
1621    Mustafa      Saad   21000
1622   Muhammad     Samir   18000
1623        Amr     Gaber   18000
1624    Mohanad     Hatem  120000
1625      Ahmed     Saleh   19500
1626     Dexter    Morgan   20000
1627     Marwan    Radwan   21000
1628       Mina   Mamdouh   17500
1629       Adel     Sobhy   19800
1630      Osama  Muhammad  150000

### Detecting Score Outlier Using Inter Quantile Range (IQR)

In [31]:
# Sort salary columns
score = df["salary"].sort_values()

# Get Q1 & Q3 of The Salary
q1, q3 = np.quantile(score, [0.25, 0.75])

# Calculate IQR = Q3 - Q1
IQR = q3 - q1

# Calculate Lower Limit 
lower_limit = q1 - (IQR * 1.5)

# Calculate Upper Limit 
upper_limit = q3 + (IQR * 1.5)

In [32]:
print(f"Limit: [{lower_limit} : {upper_limit}]")

Limit: [15375.0 : 24375.0]

### Filter Data To Remove The Outlier Records

In [36]:
filt = (df["salary"] >= lower_limit) & (df["salary"] <= upper_limit)

In [37]:
filterd_df = df.loc[filt]

In [41]:
# We Notice That 2 Records are Removed
filterd_df.shape

(9, 3)

In [42]:
filterd_df

     first_name last_name  salary
id
1620   Muhammad    Khalil   20000
1621    Mustafa      Saad   21000
1622   Muhammad     Samir   18000
1623        Amr     Gaber   18000
1625      Ahmed     Saleh   19500
1626     Dexter    Morgan   20000
1627     Marwan    Radwan   21000
1628       Mina   Mamdouh   17500
1629       Adel     Sobhy   19800